# Задание 3.
# Узнайте у пользователя целое положительное число n.
# Найдите сумму чисел n + nn + nnn.
# Пример:
# Введите число n: 3
# n + nn + nnn = 369
n = int(input('введите целое положительное число '))
print(n, n + n, n + n + n, sep='')
m = input('введите целое положительное число ')
print(m + 2 * m + 3 * m)
