# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
# если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10
s = int(input('введите общее колличество журавликов'), )
if s % 2 == 0:
    print(s // 6, 2 * s // 3, s // 6)
else:
    if s // 6 + s - s // 3 + s // 6 < s:
        print(s // 6, s - s // 3 + 1, s // 6)
    else:
        print(s // 6, s - s // 3, s // 6)
